#+TITLE: Structuring Programs with Monad Transformers

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

- Extend monad functionality with monad transformers
- Describing an application structure with monad stacks
- Define monad transformers
- Overview of the most common monad transformers

* 6.1 The problem of combining monads

Evaluate an expression in reverse Polish notation like "2 3 +". The algorithm is
stack based and it's the following:

- If it's a number push into the stack
- If it's an operator
  - Pop two numbers from the stack
  - Apply the operator
  - Push the result back onto the stack
- At the end you should have one value into the stack, this is the result

#+BEGIN_SRC haskell
import Control.Monad.State

type Stack = [Integer]
type EvalM = State Stack

:{
push :: Integer -> EvalM ()
push x = modify (x:)
:}

:{
pop :: EvalM Integer
pop = do
  xs <- get
  put $ tail xs
  pure $ head xs
:}

:{
evalRPN :: String -> Integer
evalRPN exp = evalState (traverse step (words exp) >> pop) []
  where step :: String -> EvalM ()
        step "+" = evalOP (+)
        step "-" = evalOP (-)
        step "*" = evalOP (*)
        step n = push $ read n
        evalOP op = flip op <$> pop <*> pop >>= push
:}

evalRPN "2 3 +"
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
5
#+END_EXAMPLE

We are not considering the following possible errors:
- Not enough element on stack on ~pop~
- In ~step~, ~read~ can fail
- At the end we can have more elements on the stack

** First attempt: use Maybe Monad

We use ~StateT~ monad transformer: adds the functionality of the ~State~ monad
with the ~Stack~ as a state and to the ~Maybe~ monad.

- ~Maybe~ monad is called the /base/ or /inner/ monad
- We add the ~State Stack~ on top of it
- Forming the /monad stack/

#+BEGIN_SRC haskell
import Control.Monad.State
import Control.Applicative
import Text.Read (readMaybe)

type Stack = [Integer]
type EvalM = StateT Stack Maybe

:{
push :: Integer -> EvalM ()
push x = modify (x:)
:}

-- How do we put the possible Nothing produced while popping from the stack?
:t lift
:t when

:{
pop :: EvalM Integer
pop = do
  xs <- get
  when (null xs) $ lift Nothing -- ASK: how can `when` work with `f ()`???
  put $ tail xs
  pure $ head xs
:}

-- Second solution is to use `guard` when `m` implements `Alternative`
:t guard

-- ASK: again with the `f ()` ???

-- Third solution is to rely on the fact that when in do notation you
-- patter match and the patter fails when desugaring GHC introduce a `fail`
-- call from `MonadFail` and `fail` for `Maybe` produces `Nothing` which
-- is what we want
--
-- pop = do
--   (x:xs) <- get
--   put xs
--   pure x

:t evalStateT

evalStateT pop []
evalStateT (push 10 >> pop) []

:{
popOnly :: EvalM Integer
popOnly = do
  xs <- get
  when (length xs /= 1) $ lift Nothing
  pure $ head xs
:}

-- ASK: (readSafe s) :: m Integer, it works because StateT s m a implements Alternative ?

:{
readSafe :: (Read a, Alternative m) => String -> m a
readSafe s =
  case readMaybe s of
    Nothing -> empty
    Just n -> pure n
:}

-- ASK: will be the same with MonadFail?
-- readSafe :: (Read a, MonadFail m) => String -> m a
-- readSafe s =
--   case readMaybe s of
--     Nothing -> fail "Unable to parse"
--     Just n -> pure n

:{
evalRPN :: String -> Maybe Integer
evalRPN exp = evalStateT ((traverse step (words exp)) >> popOnly) []
  where step :: String -> EvalM ()
        step "+" = stepOP (+)
        step "-" = stepOP (-)
        step "*" = stepOP (*)
        step s = readSafe s >>= push
        stepOP op = flip op <$> pop <*> pop >>= push
:}

evalRPN "5 4 +"
evalRPN "5 4 5 +"
evalRPN "5 foo +"
evalRPN "hello"
evalRPN "4"
evalRPN "4 5"
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
lift :: (MonadTrans t, Monad m) => m a -> t m a
when :: Applicative f => Bool -> f () -> f ()
guard :: Alternative f => Bool -> f ()
evalStateT :: Monad m => StateT s m a -> s -> m a
Nothing
Just 10
Just 9
Nothing
Nothing
Nothing
Just 4
Nothing
#+END_EXAMPLE

** Can we do it without RWST?

#+BEGIN_SRC haskell :eval never
newtype MyApp l s a = MyApp {
  runApp :: ReaderT AppEnv
              (WriterT [l]
                (StateT s IO)
              )
            a
  } deriving (Functor,
              Applicative,
              Monad,
              MonadIO,
              MonadReader AppEnv,
              MonadWriter [l],
              MonadState s)
#+END_SRC

The ~deriving~ machinery will implement the needed functions (e.g. ~tell~) by
lifting the original implementation (~tell~) an appropriate number of times to
reach the corresponding monad in the stack (~lift . tell~)

ASK: why not ~lift tell~

#+BEGIN_SRC haskell
import qualified Control.Monad.Trans.Writer as W
import qualified Control.Monad.Trans.State as S

:t W.tell
:t lift
:t lift . W.tell
:t lift W.tell
:t S.get
:t lift S.get
:t lift . S.get -- Wrong
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
W.tell :: Monad m => w -> WriterT w m ()
lift :: (MonadTrans t, Monad m) => m a -> t m a
lift . W.tell
  :: (MonadTrans t, Monoid w, Monad m) => w -> t (WriterT w m) ()
lift W.tell
  :: (MonadTrans t, Monad m) => t ((->) w) (WriterT w m ())
S.get :: Monad m => StateT s m s
lift S.get :: (MonadTrans t, Monad m) => t (StateT a m) a
<interactive>:1:8: error:
    • Couldn't match expected type ‘a -> m a1’
                  with actual type ‘StateT s0 m0 s0’
    • In the second argument of ‘(.)’, namely
        ‘Control.Monad.Trans.State.get’
      In the expression: lift . Control.Monad.Trans.State.get
#+END_EXAMPLE

** Step 4: implement full monad stack functionality

- We should be able to go up down the with lift
- We should allow automatic lifting to avoid bothering the user

Function ~lift~ is defined by ~MonadTrans~ type class in ~Control.Monad.Trans~

#+BEGIN_SRC haskell
import Control.Monad.Trans

:i MonadTrans
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
type MonadTrans :: ((* -> *) -> * -> *) -> Constraint
class MonadTrans t where
  lift :: Monad m => m a -> t m a
  {-# MINIMAL lift #-}
        -- Defined in ‘Control.Monad.Trans.Class’
instance [safe] MonadTrans (ReaderT r)
  -- Defined in ‘Control.Monad.Trans.Reader’
instance [safe] Monoid w => MonadTrans (WriterT w)
  -- Defined in ‘Control.Monad.Trans.Writer.Lazy’
instance [safe] MonadTrans (StateT s)
  -- Defined in ‘Control.Monad.Trans.State.Lazy’
#+END_EXAMPLE

#+NAME: step-4
#+BEGIN_SRC haskell
<<step-3>>

import Control.Monad.Trans

:{
instance MonadTrans MaybeT where
  lift ma = MaybeT $ Just <$> ma
:}
#+END_SRC

** Using a transformer

We will use now ~MaybeT~ to evaluate the RPN expression, it should work with
only minor modifications

#+BEGIN_SRC haskell
<<step-6>>

import Control.Applicative
import Control.Monad.State
import Text.Read (readMaybe)

type Stack = [Integer]
type EvalM = MaybeT (State Stack)

:{
push :: Integer -> EvalM ()
push x = modify (x:)
:}

:{
pop :: EvalM Integer
pop = do
  xs <- get
  when (null xs) $ fail "nothing to pop"
  put $ tail xs
  pure $ head xs
:}

:{
popOnly :: EvalM Integer
popOnly = do
  xs <- get
  when (length xs /= 1) $ fail "more then on thing to pop"
  pure $ head xs
:}

:{
readSafe :: (Read a, Alternative m) => String -> m a
readSafe s =
  case readMaybe s of
    Nothing -> empty
    Just n -> pure n
:}

:{
evalRPN :: String -> Maybe Integer
evalRPN exp = evalState (runMaybeT ((traverse step (words exp)) >> popOnly)) []
  where step :: String -> EvalM ()
        step "+" = stepOP (+)
        step "-" = stepOP (-)
        step "*" = stepOP (*)
        step s = readSafe s >>= push
        stepOP op = flip op <$> pop <*> pop >>= push
:}

evalRPN "2 5 +"
evalRPN "2 5"
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Just 7
Nothing
#+END_EXAMPLE

